app/controllers/employees_controller.rb

  def index
    @employee = Employee.all
---
SELECT "employees".* FROM "employees"