app/controllers/evaluations_controller.rb

SELECT "evaluations".* FROM "evaluations"
---
  def index
    @evaluation = Evaluation.all

INSERT INTO "evaluations" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-09-14 05:37:20.661522"], ["updated_at", "2016-09-14 05:37:20.661522"]]
---
  def create
    @evaluation = Evaluation.new(evaluation_params)

    respond_to do |format|
      if @evaluation.save

SELECT  "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_evaluation
      @evaluation = Evaluation.find(params[:id])