app/controllers/motors_controller.rb

SELECT "motors".* FROM "motors"
---
  def index
    @motor = Motor.all